Revit 2027 API
IPipePressureDropServer.Calculate Method
 Calculate the pipe pressure drop.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void Calculate(
	PipePressureDropData data
)
Sub Calculate (
	data As PipePressureDropData
)
void Calculate(
	PipePressureDropData^ data
)
abstract Calculate :
        data : PipePressureDropData -> unit
Parameters
data PipePressureDropData
 The input and output data of the calculation.
See Also
Reference
IPipePressureDropServer Interface
Autodesk.Revit.DB.Plumbing Namespace